```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kubenodes.cloudflare_record.k8s-hydra[0] will be updated in-place
  ~ resource "cloudflare_record" "k8s-hydra" {
      ~ content         = "159.69.144.38" -> (known after apply)
        id              = "668264bf8c17003bb43eaf7a1a3c468f"
        name            = "hydra.k8s.thetillhoff.de"
        tags            = []
        # (10 unchanged attributes hidden)
    }

  # module.kubenodes.cloudflare_record.k8s-hydra[1] will be updated in-place
  ~ resource "cloudflare_record" "k8s-hydra" {
      ~ content         = "94.130.98.9" -> (known after apply)
        id              = "8207ef32ad46a2dff8b4be58bc275550"
        name            = "hydra.k8s.thetillhoff.de"
        tags            = []
        # (10 unchanged attributes hidden)
    }

  # module.kubenodes.cloudflare_record.k8s-hydra[2] will be updated in-place
  ~ resource "cloudflare_record" "k8s-hydra" {
      ~ content         = "128.140.45.249" -> (known after apply)
        id              = "06804c48bcbdbc6f03c3d4fbda9cb963"
        name            = "hydra.k8s.thetillhoff.de"
        tags            = []
        # (10 unchanged attributes hidden)
    }

  # module.kubenodes.hcloud_server.kubenodes[0] must be replaced
-/+ resource "hcloud_server" "kubenodes" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "nbg1-dc3" -> (known after apply)
      ~ firewall_ids               = [] -> (known after apply)
      ~ id                         = "58507727" -> (known after apply)
      ~ ipv4_address               = "159.69.144.38" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:1c0c:6fd3::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:1c0c:6fd3::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "kubenode-0"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 40 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = (sensitive value) # forces replacement
        # (10 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.kubenodes.hcloud_server.kubenodes[1] must be replaced
-/+ resource "hcloud_server" "kubenodes" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "nbg1-dc3" -> (known after apply)
      ~ firewall_ids               = [] -> (known after apply)
      ~ id                         = "58507728" -> (known after apply)
      ~ ipv4_address               = "94.130.98.9" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:c2c:c52a::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:c2c:c52a::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "kubenode-1"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 40 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = (sensitive value) # forces replacement
        # (10 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.kubenodes.hcloud_server.kubenodes[2] must be replaced
-/+ resource "hcloud_server" "kubenodes" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "nbg1-dc3" -> (known after apply)
      ~ firewall_ids               = [] -> (known after apply)
      ~ id                         = "58507729" -> (known after apply)
      ~ ipv4_address               = "128.140.45.249" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:c2c:63d5::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:c2c:63d5::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "kubenode-2"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 40 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = (sensitive value) # forces replacement
        # (10 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.kubenodes.helm_release.cilium will be updated in-place
  ~ resource "helm_release" "cilium" {
        id                         = "cilium"
        name                       = "cilium"
      ~ version                    = "1.16.4" -> "1.16.5"
        # (27 unchanged attributes hidden)
    }

  # module.kubenodes.local_sensitive_file.kubeconfig[0] will be created
  + resource "local_sensitive_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "kubenodes/kubeconfig"
      + id                   = (known after apply)
    }

  # module.kubenodes.talos_cluster_kubeconfig.kubeconfig will be updated in-place
  ~ resource "talos_cluster_kubeconfig" "kubeconfig" {
      ~ endpoint                        = "159.69.144.38" -> (known after apply)
        id                              = "hydra"
      ~ node                            = "159.69.144.38" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.kubenodes.talos_machine_bootstrap.main will be updated in-place
  ~ resource "talos_machine_bootstrap" "main" {
      ~ endpoint             = "159.69.144.38" -> (known after apply)
        id                   = "machine_bootstrap"
      ~ node                 = "159.69.144.38" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubenodes.talos_machine_configuration_apply.main[0] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "main" {
      ~ endpoint                    = "159.69.144.38" -> (known after apply)
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      ~ node                        = "159.69.144.38" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.kubenodes.talos_machine_configuration_apply.main[1] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "main" {
      ~ endpoint                    = "94.130.98.9" -> (known after apply)
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      ~ node                        = "94.130.98.9" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.kubenodes.talos_machine_configuration_apply.main[2] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "main" {
      ~ endpoint                    = "128.140.45.249" -> (known after apply)
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      ~ node                        = "128.140.45.249" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 9 to change, 3 to destroy.
```
